Repository: SalineOS/SalineOS
Catalog: Yad/yad-0.17.1.1/po/*.po
Languages: uk

source: translator-credits
uk: Віктор Ананьєвський <ananasik@gmail.com>

source: YAD is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version. YAD is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with YAD. If not, see <http://www.gnu.org/licenses/>.
uk: YAD - це вільна програма; ви можете розповсюджувати її та/чи змінювати на умовах ліцензії GNU General Public License, що опублікована Free Software Foundation; версії 2 цієї ліцензії, чи (на вашу думку) будь-якою більш пізнішої версії. Ця програма розповсюджується в сподіванні на те, що вона буде корисною, але БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ, в тому числі без неявної гарантії КОМЕРЦІЙНОЇ ЦІННОСТІ чи ПРИДАТНОСТІ ДЛЯ БУДЬ-ЯКИХ ЦІЛЕЙ. Докладніше про це дивіться GNU General Public License. Ви мали отримати копію GNU General Public License разом з цією програмою; якщо це не так, дивіться <http://www.gnu.org/licenses/>.

source: Yet Another Dialog (show dialog boxes from shell scripts) Based on Zenity code
uk: Yet Another Dialog (Програма для відображення диалогових вікон із скриптов оболонки) Базується на коді Zenity

source: Cannot open file '%s': %s
uk: Не можу відкрити файл %s: %s

source: Maximum value must be greater than minimum value.
uk: Максимальне значення повинно бути більше, ніж мінімальне.

source: Initial value less than minimal.
uk: Початкове значення менше за мінімальне.

source: Initial value greater than maximum.
uk: Початкове значенння більше за маскимальне.

source: Select files
uk: Вибір файлів

source: Select folders
uk: Вибір каталогів

source: Select or create file
uk: Вібир або створення файлу

source: Select or create folder
uk: Вибір або створення каталога

source: Select date
uk: Вибір дати

source: Select file
uk: Вибір файла

source: Select folder
uk: Вибір каталога

source: Unable to parse file %s: %s
uk: Не можу розібрати файл %s: %s

source: Unable to open directory %s: %s
uk: Не можу відкрити каталог %s: %s

source: %d sec
uk: %d сек

source: Unable parse command line: %s
uk: Не вдається розібрати командну строку: %s

source: Could not load notification icon '%s': %s
uk: Не вдається завантажити іконку '%s': %s

source: Invalid UTF-8 in tooltip!
uk: Неправильна послідовність UTF-8 у підказці!

source: Unknown command '%s'
uk: Невідома команда '%s'

source: Yad notification
uk: Діалог повідомлень

source: Add row
uk: Добавити строку

source: Delete row
uk: Видалити строку

source: No column titles specified for List dialog.
uk: Не задані заголовоки колонок для діалога зі списком

source: Set the dialog title
uk: Задати заголовок діалога

source: TITLE
uk: ЗАГОЛОВОК

source: Set the window icon
uk: Задати іконку діалога

source: ICONPATH
uk: ІКОНКА

source: Set the width
uk: Задати ширину вікна

source: WIDTH
uk: ШИРИНА

source: Set the height
uk: Задати висоту вікна

source: HEIGHT
uk: ВИСОТА

source: Set the window geometry
uk: Задати геометрію вікна

source: WxH+X+Y
uk: ВxШ+X+Y

source: Set dialog timeout in seconds
uk: Задати врем'я роботи діалога в секундах

source: TIMEOUT
uk: ЗАТРИМКА

source: Show remaining time indicator (top, bottom, left, right)
uk: Показувати індикатор затримки (top, bottom, left, right)

source: POS
uk: ПОЗИЦІЯ

source: Set the dialog text
uk: Задати текст діалога

source: TEXT
uk: ТЕКСТ

source: Set the dialog text alignment (left, center, right)
uk: Задати вирівнювання тексту діалога (left, center або right)

source: TYPE
uk: ТИП

source: Set the dialog image
uk: Задати картинку діалога

source: IMAGE
uk: КАРТИНКА

source: Show image above main widget
uk: Показувати картинку над основним віджетом

source: Use specified icon theme instead of default
uk: Використовувати вказану тему іконок

source: THEME
uk: ТЕМА

source: Hide main widget with expander
uk: Приховати головний віджет

source: Add dialog button (may be used multiple times)
uk: Додати кнопку (може використовуватись декілька разів)

source: NAME:ID
uk: ІМ'Я:ID

source: Don't show buttons
uk: Не показувати кнопки

source: Don't use pango markup language in dialog's text
uk: Не використовувати розмітку pango у тексті

source: Add separator between dialog and buttons
uk: Додати розділювач між діалогом та кнопками

source: Set window borders
uk: Задати межи вікна

source: NUMBER
uk: ЧИСЛО

source: Always print result
uk: Завжди виводити результат

source: Dialog text can be selected
uk: Текст діалога може буди виділеним

source: Set window sticky
uk: Вікно існує на всіх робочих місцях

source: Set window unresizable
uk: Незмінний розмір

source: Place window on top
uk: Поместити вікно над іншими

source: Place window on center of screen
uk: Поместити вікно у центрі экрану

source: Place window at the mouse position
uk: Поместити вікно у позиції мишки

source: Set window undecorated
uk: Відалити границі вікна

source: Don't show window in taskbar
uk: Не показувати вікно у панелі задач

source: Send TERM to parent
uk: Послати TERM родителю

source: Print X Window Id to the stderr
uk: Вивести ідентифікатор вікна на stderr

source: Display calendar dialog
uk: Відобразити діалог для вибору дати

source: Set the calendar day
uk: Задати день календаря

source: DAY
uk: ДЕНЬ

source: Set the calendar month
uk: Задати місяць календаря

source: MONTH
uk: МІСЯЦЬ

source: Set the calendar year
uk: Задати год календаря

source: YEAR
uk: ГОД

source: Set the format for the returned date
uk: Задати формат відображення дати

source: PATTERN
uk: ШАБЛОН

source: Set the filename with dates details
uk: Задати ім'я файла з описанням дат

source: FILENAME
uk: ІМ'Я ФАЙЛА

source: Display color selection dialog
uk: Відобразити діалог для вибору коліра

source: Alias for --color
uk: Синоним для --color

source: Set initial color value
uk: Задати початковий колір

source: COLOR
uk: КОЛІР

source: Set path to palette file. Default -
uk: Задати путь до файлу кольорів. Без імені -

source: Use #rrrrggggbbbb format instead of #rrggbb
uk: Викорістовувати формат #rrrrggggbbbb замість #rrggbb

source: Display drag-n-drop box
uk: Відобразити діалог для перехоплення dnd

source: Use dialog text as tooltip
uk: Використовувати текст діалога у якості підказки

source: Set command for process d-n-d data
uk: Команда для обробки отриманих даних

source: CMD
uk: КОМАНДА

source: Display text entry or combo-box dialog
uk: Відобразити діалог для вводу тексту або вибору варіанта

source: Set the entry label
uk: Задати метку поля ввода

source: Set the entry text
uk: Задати текст для поля вводу

source: Hide the entry text
uk: Сховати введений текст (Пароль)

source: Use completion instead of combo-box
uk: Використовувати автозаповнення замість списку значень

source: Use spin button for text entry
uk: Використовувати числове поле замість тексту

source: Allow changes to text in combo-box
uk: Дозволити змінювати текст у режимі выбору варіанта

source: Set the left entry icon
uk: Задати леву іконку

source: Set the left entry icon action
uk: Дія для лівої іконки

source: Set the right entry icon
uk: Задати праву іконку

source: Set the right entry icon action
uk: Дія для правої іконки

source: Display file selection dialog
uk: Відобразити діалог для выбору файла

source: Alias for --file
uk: Синоним для --file

source: Set the filename
uk: Задати ім'я файла

source: Allow multiple files to be selected
uk: Дозволити вибір декільких файлів

source: Activate directory-only selection
uk: Активувати виделення тільки по каталогам

source: Activate save mode
uk: Активувавти режим зберігання

source: Set output separator character
uk: Установити вихідний розділювач

source: SEPARATOR
uk: РОЗДІЛЮВАЧ

source: Confirm file selection if filename already exists
uk: Підтвердити вибір файлу, якщо файл вже існує

source: [TEXT]
uk: [ТЕКСТ]

source: Sets a filename filter
uk: Задати фільтр файлів

source: NAME | PATTERN1 PATTERN2 ...
uk: ІМ'Я | ШАБЛОН1 ШАБЛОН2 ...

source: Display font selection dialog
uk: Відобразити діалог для выбору шрифта

source: Alias for --font
uk: Синоним для --font

source: Set initial font
uk: Задати початковий шрифт

source: FONTNAME
uk: ІМ'Я_ШРИФТА

source: Set preview text
uk: Задати текст зразка

source: Display form dialog
uk: Відобразити діалог форми вводу

source: Add field to form (TYPE - H, RO, NUM, CHK, CB, CBE, FL, SFL, MFL, DIR, CDIR, MDIR, FN, DT, CLR, BTN, LBL or TXT)
uk: Додати поле до форми (Тип поля: Н, RO, NUM, CHK, CB, CBE, FL, SFL, MFL, DIR, CDIR, MDIR, FN, MFL, DT, CLR, BTN, LBL або TXT)

source: LABEL[:TYPE]
uk: МІТКА[:ТИП]

source: Set alignment of fileds labels (left, center or right)
uk: Задати вирівнювання міток полей (left, center або right)

source: Set number of columns in form
uk: Задати кількість колонок у формі

source: Set separator character for combobox or scale data
uk: Задати рохділювач для даних списку або числового поля

source: Display icons box dialog
uk: Відобразити діалог з іконками швидкого доступу

source: Read data from .desktop files in specified directory
uk: Читати дані з .desktop файлів в заданому каталозі

source: DIRECTORY
uk: КАТАЛОГ

source: Use compact (list) view
uk: Використовувати компактний вид (список)

source: Use GenericName field instead of Name for icon label
uk: Використовувати поле GenericName замість Name для метки

source: Read data from stdin
uk: Читати дані зі стандартного вводу

source: Set the width of dialog items
uk: Задати ширину елементу діалога

source: Use specified pattern for launch command in terminal (default: xterm -e %s)
uk: Використовувати вказаний шаблон для запуску у терміналі (без шаблону: xterm -e %s)

source: Sort items by name instead of filename
uk: Сортувати по полю Ім'я замість файла

source: Sort items in descending order
uk: Сортувати у порядку пониження

source: Display list dialog
uk: Відобразити діалог зі списком

source: Don't show column headers
uk: Не показувати заголовки колонок

source: Set the column header (TYPE - TEXT, NUM, FLT, CHK, IMG or TIP)
uk: Задати заголовок стовбця (ТИП - TEXT, NUM, FLT, CHK, IMG або TIP)

source: COLUMN[:TYPE]
uk: СТОЛБЕЦЬ[:ТИП]

source: Use check boxes for first column
uk: Вікористовувати флажки для першої колонки

source: Alias to checklist (deprecated)
uk: Синоним для checklist

source: Allow multiple rows to be selected
uk: Дозволити вибір декількох строк

source: Allow changes to text
uk: Дозволити зминювати текст

source: Print all data from list
uk: Виводити таблицю повністю

source: Set ellipsize mode for text columns (TYPE - NONE, START, MIDDLE or END)
uk: Задати тип усікання для текстових стовбців (ТИП - NONE, START, MIDDLE або END)

source: Print a specific column. By default or if 0 is specified will be printed all columns
uk: Виводити тільки вказаний стовбець. Без вказівки або якщо стовбець дорівнює 0, будуть виведені усі стовбці

source: Hide a specific column
uk: Сховати вказаний стовбець

source: Set the column expandable by default. 0 sets all columns expandable
uk: Задати колонку, яка расширюється. 0 розширює усі колонки

source: Set the quick search column. Default is first column. Set it to 0 for disable searching
uk: Задати колонку пошуку. Без вказівки вікорістовується перший стовбчик. 0 забороняє пошук

source: Set the limit of rows in list
uk: Задати кількість рядків у списку

source: Set double-click action
uk: Дія для подвійного кліку мишки

source: Use regex in search
uk: Використовувати регулярні вирази у пошуку

source: Display multi progress bars dialog
uk: Відобразити діалог с декількома індикаторами

source: Add the progress bar (TYPE - NORM, RTL or PULSE)
uk: Додати індикатор (ТИП - NORM, RTL або PULSE)

source: Show vertical bars
uk: Відобразити вертикальні індикатори

source: Display notification
uk: Відобразити діалог повідомлень

source: Set left-click action
uk: Дія для лівого кліку мишки

source: Listen for commands on stdin
uk: Читати команди зі стандартного вводу

source: Set separator character for menu values
uk: Встановити роздилювач для значень меню

source: Set separator character for menu items
uk: Встановити розділювач для елементів меню

source: Display printing dialog
uk: Відобразити діалог друку

source: Source filename
uk: Ім'я файла

source: Set source type (TYPE - TEXT, IMAGE or RAW)
uk: Задати тип даних (ТИП - TEXT, IMAGE або RAW)

source: Add headers to page
uk: Додати колонтитули до сторінки

source: Enable preview in print dialog
uk: Додати попередній перегляд до діалогу друку

source: Use specified font
uk: Використовувати вказаний шрифт

source: Display progress indication dialog
uk: Відобразити діалог прогресу

source: Set progress text
uk: Показувати текст на індикаторі

source: Set initial percentage
uk: Задати початковий процент

source: PERCENTAGE
uk: ПРОЦЕНТИ

source: Pulsate progress bar
uk: Пульсуючий індикатор прогресу

source: Dismiss the dialog when 100% has been reached
uk: Закрити діалог по досягнені 100%

source: Kill parent process if cancel button is pressed
uk: Завершити батьківський процес, якщо натиснута кнопка відміни

source: Right-To-Left progress bar direction
uk: Напрямок індикатору Зправа-Наліво

source: Display scale dialog
uk: Відобразити діалог масштабу

source: Set initial value
uk: Задати початкове значення

source: VALUE
uk: ЗНАЧЕННЯ

source: Set minimum value
uk: Задати мінімальне значення

source: Set maximum value
uk: Задати максимальне значення

source: Set step size
uk: Задати крок

source: Set paging size
uk: Задати крок сторінки

source: Print partial values
uk: Виводити часткові значення

source: Hide value
uk: Сховати значення

source: Show vertical scale
uk: Відобразити вертикальну шкалу

source: Invert direction
uk: Інвертувати напрямок

source: Add mark to scale (may be used multiple times)
uk: Додати помітку (може використовуватись декілька разів)

source: NAME:VALUE
uk: ІМ'Я:ЗНАЧЕННЯ

source: Display text information dialog
uk: Відобразити діалог з текстовою інформацією

source: Use specified color for text
uk: Використовувати вказаний колір тексту

source: Use specified color for background
uk: Виктористовувати вказаний колір фону

source: Enable text wrapping
uk: Дозволити перенос тексту

source: Set justification (TYPE - left, right, center or fill)
uk: Встановити вирівнювання (ТИП - left, right, center або fill)

source: Set text margins
uk: Встановити відступи

source: SIZE
uk: РОЗМІР

source: Autoscroll to end of text
uk: Автопрокрутка у кінець тексту

source: Open file
uk: Відкрити файл

source: Make URI clickable
uk: Зробити посилання активними

source: Show about dialog
uk: Показати діалог 'Про програму'

source: Print version
uk: Вивести версію

source: Load extra arguments from file
uk: Заванатажити додаткові аргументи з файлу

source: Unknown align type: %s
uk: Невідомий тип вирівнювання: %s

source: Mark %s doesn't have a value
uk: Помітці %s не встановлено значення

source: Unknown justification type: %s
uk: Невідомий тип вирівнювання: %s

source: Unknown ellipsize type: %s
uk: Невідомий тип усікання: %s

source: Unknown source type: %s
uk: Невідомий тип даних: %s

source: File exist. Overwrite?
uk: Файл існує. Перезаписати?

source: Yet another dialoging program
uk: Програма для відображення діалогів

source: General options
uk: Основні параметри

source: Show general options
uk: Показувати основні параметри

source: Calendar options
uk: Параметри календаря

source: Show calendar options
uk: Показувати параметри календаря

source: Color selection options
uk: Параметри діалога вибору коліра

source: Show color selection options
uk: Показувати параметри діалога вибору коліра

source: DND options
uk: Параметри DND

source: Show drag-n-drop options
uk: Показувати параметри dnd

source: Text entry options
uk: Параметри вводу текста

source: Show text entry options
uk: Показувати параметри вводу текста

source: File selection options
uk: Параметри діалога вибору файла

source: Show file selection options
uk: Показувати параметри діалога вибору файлів

source: Font selection options
uk: Параметри діалога вибору шрифта

source: Show font selection options
uk: Показувати параметри діалога вибору шрифта

source: Form options
uk: Параметри діалога форми

source: Show form options
uk: Показувати параметри діалога форми

source: Icons box options
uk: Параметри діалога іконок

source: Show icons box options
uk: Показувати параметри діалога іконок швидкого доступа

source: List options
uk: Параметри списка

source: Show list options
uk: Показувати параметри списка

source: Multi progress bars options
uk: Параметри діалога с декількома індикаторами

source: Show Multi progress bars options
uk: Показувати параметри діалога с декількома індикаторами

source: Notification icon options
uk: Параметри іконки повідомлення

source: Show notification icon options
uk: Показувати параметри іконки повідомленнь

source: Print dialog options
uk: Параметри діалога друку

source: Show print dialog options
uk: Показувати параметри діалога друку

source: Progress options
uk: Параметри ходу прогреса

source: Show progress options
uk: Показувати параметри ходу прогреса

source: Scale options
uk: Параметри масштаба

source: Show scale options
uk: Показувати параметри масштаба

source: Text information options
uk: Параметри текстової інформації

source: Show text information options
uk: Показувати параметри текстової інформації

source: Miscellaneous options
uk: Додаткові параметри

source: Show miscellaneous options
uk: Показувати додаткові параметри

source: Printing failed: %s
uk: Сбій друку: %s

source: File %s not found.
uk: Файл %s не знайден.

source: Filename is not specified.
uk: Файл не вказан.

source: Printer doesn't support ps format.
uk: Принтер не підтримує формат ps.

source: Printer doesn't support pdf format.
uk: Принтер не підтримує формат pdf.

source: This file type is not supported for raw printing.
uk: Цей тип файлів не може бути надрукований.

source: Load source file failed: %s
uk: Сбій при завантажені файла: %s

source: Can't open file %s: %s
uk: Не можу відкрити файл %s: %s

source: Palette
uk: Палитра

source: Color
uk: Колір

source: Name
uk: Назва

source: Invalid UTF-8 data encountered reading file %s
uk: Невірна послідовність UTF-8 при читанні файлу %s

source: scalable
uk: масштабуємий

source: <b>Name:</b> %s <b>Sizes:</b> %s <b>Filename:</b> %s
uk: <b>Ім'я:</b> %s <b>Разміри:</b> %s <b>Имєя файла:</b> %s

source: built-in
uk: вбудований

source: - Icon browser
uk: - Броузер іконок

source: Icon browser
uk: Броузер іконок

source: Category
uk: Категорія

source: Icons
uk: Іконки

source: Icon Browser
uk: Броузер іконок

source: Inspect GTK Icon Theme
uk: Дослідження теми іконок GTK
